{
"fr" : {
    "Profil" : {
        "img": "./assets/img/profil/pp-discord.jpg",
        "banner": "./assets/img/profil/pp-discord.webp",
        "date": "now",
        "color": "color-2",
        "title1": "Aspirant architecte-data",
        "text1": "Je suis un développeur principalement orienté back-end passionné d’algorithmie. Mon expertise repose sur la conception, le développement, et la maintenance de l'infrastructure serveur, ainsi que sur la gestion efficace des bases de données. Mon objectif est de fournir des solutions technologiques efficaces qui améliorent les performances et l'évolutivité des applications"
    },
    "STI2D" : {
        "img": "./assets/img/content/branly.png",
        "banner": "./assets/img/content/branly.png",
        "date": "2022",
        "color": "color-5",
        "title1": "Baccalauréat STI2D, option Systèmes d'Information et Numérique (SIN), mention Bien",
        "text1": "J'ai obtenu mon Baccalauréat STI2D avec mention Bien au Lycée Edouard Branly. Initialement inscrit en filière générale avec une option en Numérique et Sciences Informatiques (NSI), j'ai rapidement découvert ma véritable passion pour les métiers du numérique. C'est pourquoi j'ai choisi de me réorienter vers la filière STI2D, spécialisée en Systèmes d'Information et Numérique (SIN). Cette décision a renforcé mon désir de devenir un développeur back-end compétent en mettant l'accent sur l'application concrète des concepts informatiques."
    },
    "LaManu" : {
        "img": "./assets/img/content/la-manu.png",
        "banner": "./assets/img/content/la-manu-2.png",
        "date": "2024",
        "color": "color-1",
        "title1": "Deuxième année de Master en Métiers du Numérique",
        "text1": "Je suis actuellement en deuxième annéee de formation à La Manu, où je poursuis un Master en Métiers du Numérique. Au cours de cette formation, j'ai acquis des compétences essentielles en développement, notamment en JavaScript (JS), Vue.js, PHP, Python, Java, ainsi que Symfony pour le développement web. J'ai également développé des compétences en gestion de bases de données MySQL, en PAO (Publication Assistée par Ordinateur), en UX/UI (Expérience Utilisateur/Interface Utilisateur), et en langages web tels qu'HTML et CSS."
    }
},
"en" : {
    "Profile": {
        "img": "./assets/img/profile/pp-discord.jpg",
        "banner": "./assets/img/profile/pp-discord.webp",
        "date": "now",
        "color": "color-2",
        "title1": "Aspiring Data Architect",
        "text1": "I am a developer primarily focused on backend development with a passion for algorithms. My expertise lies in designing, developing, and maintaining server infrastructure, as well as efficiently managing databases. My goal is to provide effective technological solutions that enhance the performance and scalability of applications."
    },
    "STI2D": {
        "img": "./assets/img/content/branly.png",
        "banner": "./assets/img/content/branly.png",
        "date": "2022",
        "color": "color-5",
        "title1": "STI2D Bachelor's Degree, specializing in Information Systems and Digital (SIN), with Honors",
        "text1": "I obtained my STI2D Bachelor's Degree with Honors from Edouard Branly High School. Initially enrolled in the general track with an option in Digital and Computer Science (NSI), I quickly discovered my true passion for digital professions. That's why I chose to reorient myself towards the STI2D track, specializing in Information Systems and Digital (SIN). This decision strengthened my desire to become a competent backend developer by focusing on the practical application of computer concepts."
    },
    "LaManu": {
        "img": "./assets/img/content/la-manu.png",
        "banner": "./assets/img/content/la-manu-2.png",
        "date": "2024",
        "color": "color-1",
        "title1": "Second year of Master's Degree in Digital Professions",
        "text1": "I am currently in my second year of training at La Manu, where I am pursuing a Master's Degree in Digital Professions. During this program, I have acquired essential development skills, including JavaScript (JS), Vue.js, PHP, Python, Java, as well as Symfony for web development. I have also developed skills in MySQL database management, desktop publishing (DTP), UX/UI (User Experience/User Interface), and web languages such as HTML and CSS."
    }
}
}